{
  "blogs": [
    {
      "title": "Kylian Mbappe: Paris St-Germain striker says he has not made a decision on his future",
      "content": "Paris St-Germain striker Kylian Mbappe says he has not made a decision on his future after scoring a superb late winner against Real Madrid in the first leg of their Champions League last-16 tie at Parc des Princes.\n\nThe France international ran between two defenders in the 94th before slotting home to secure a 1-0 win.\n\nMbappe is out of contract in the summer and has been linked with Real.\n\n\"I play for one of the best teams in the world,\" he told Movistar TV.\n\n\"I'm going to give it my all for the remainder of the season. I haven't decided on my future.\"\n\nTuesday night's game was widely billed as an audition for Mbappe but regardless of whether that was true or not he certainly made an impression.\n\nThe 23-year-old had PSG's only shot on goal in the first half and won a penalty in the 62nd minute when he was brought down inside the box, only for Lionel Messi to see his spot-kick saved.\n\nFrench football journalist Julien Laurens believes Mbappe will leave it until the summer before making any definitive decisions on his future.\n\n\"It is fascinating to see he doesn't want to take any decision before the second leg,\" Laurens told BBC Radio 5 live.\n\n\"I believe he will wait until the end of this season. He can go wherever he wants as a free agent.\n\n\"PSG are really hoping that if they win this tie and qualify, they can say they we are a better team than Real Madrid. They have also said 'if you stay we are trying to sign Paul Pogba, trying to sign players to make this team better, so why not stay one more year?'.",
      "author": "Łukasz",
      "id": 4
    },
    {
      "title": "Qatar Open: Andy Murray beats Taro Daniel in straight sets to reach last 16",
      "content": "Britain's Andy Murray cruised into the last 16 of the Qatar Open with a straight-set victory over Taro Daniel.\n\nThe three-time Grand Slam winner, 34, avenged last month's Australian Open defeat by Daniel by beating Japan's world number 110 on Tuesday.\n\nMurray, who won 6-2 6-2, will now face second seed Roberto Bautista Agut.\n\nEarlier this month, former world number one Murray broke back into the world's top 100 for the first time since May 2018 having recovered from hip surgery.\n\nEvans beats Gerasimov to reach Qatar Open last 16\nThe world number 87, who received a wildcard for the event in Doha, broke Daniel's serve twice to clinch the first set.\n\nAnd although Daniel broke Murray at the start of the second, the Briton took his opponent's next two service games before clinching success by breaking the 29-year-old for a fifth time overall.\n\nIf Murray beats Spain's Bautista Agut he could have a quarter-final clash with compatriot Dan Evans, who faces another Spaniard, Alejandro Davidovich Fokina, in the last 16.\n\nAfter losing to Daniel in the second round in Melbourne, Murray reached the second round of the Rotterdam Open last week, where he was beaten by world number nine Felix Auger-Aliassime.",
      "author": "Dominika",
      "id": 5
    },
    {
      "title": "Hungary and Poland lose EU funding fight over laws",
      "content": "Hungary and Poland have lost their court challenge to an EU rule that allows billions of euros of funding to be conditional on democratic standards.\n\nThe European Court of Justice ruled that complying with rule of law was a condition of enjoying membership of the EU.\n\nGovernments in Hungary and Poland have been widely accused of backsliding on standards in recent years.\n\nHungary's governing party condemned the ruling as a political decision.\n\nThe ECJ ruled that \"sound financial management of the EU's budget\" could be seriously compromised by breaches of rule of law.\n\nEU member states signed up to common values such as rule and law and solidarity and the EU \"must be able to defend those values\".\n\nBoth countries have been investigated for undermining the independence of courts, media and non-governmental organisations and both are key recipients of EU funding.\n\nThe court ruling could affect the way billions of euros of Covid recovery money is shared among member states.\n\nPolish deputy minister Janusz Kowalski accused the EU of trying starve Hungary and Poland financially.\n\n\"This is the end of the EU as we know it! We must defend Polish sovereignty,\" he said.",
      "author": "Łukasz",
      "id": 6
    }
  ]
}